#### Pandas
- Data processing
- Data analyzing
- Two types of data
    * series(multilple rows,single column)
    * dataframe(mutiple rows and multiple columns)

In [1]:
#pip install pandas
import pandas as pd

In [2]:
#Series
dir(pd)

['Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NaT',
 'Panel',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseArray',
 'SparseDataFrame',
 'SparseDtype',
 'SparseSeries',
 'TimeGrouper',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_hashtable',
 '_lib',
 '_libs',
 '_np_version_under1p13',
 '_np_version_under1p14',
 '_np_version_under1p15',
 '_np_version_under1p16',
 '_np_version_under1p17',
 '_tslib',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'datetime',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'np',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_msgpack',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_msgpack',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [3]:
data=pd.Series()
print(data)

Series([], dtype: float64)

In [4]:
data=pd.Series([1,2,3,4,"python",56.2])
data

0         1
1         2
2         3
3         4
4    python
5      56.2
dtype: object

In [5]:
data=pd.Series((12,"apssdc",34,100),index=['a','b','c','d'])
data

a        12
b    apssdc
c        34
d       100
dtype: object

In [6]:
data.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [8]:
data.index[0]

'a'

In [7]:
data.values

array([12, 'apssdc', 34, 100], dtype=object)

In [9]:
data.values[-1]

100

In [10]:
data.values[1:3]

array(['apssdc', 34], dtype=object)

In [11]:
data

a        12
b    apssdc
c        34
d       100
dtype: object

In [12]:
data[0]

12

In [13]:
data[-1]

100

In [14]:
# dataframe
df=pd.DataFrame([1,2,3,4])
df

   0
0  1
1  2
2  3
3  4

In [16]:
df=pd.DataFrame([["maths",75,89],["physics",25,56],["chemistry",56,67]])
df

           0   1   2
0      maths  75  89
1    physics  25  56
2  chemistry  56  67

In [20]:
df=pd.DataFrame({"maths":[75,58,12,10],"physics":[25,85,25,100],"chemistry":[56,45,10,2]})

In [21]:
df

   maths  physics  chemistry
0     75       25         56
1     58       85         45
2     12       25         10
3     10      100          2

In [22]:
data={"maths":[75,58,12,10],"physics":[25,85,25,100],"chemistry":[56,45,10,2]}
df=pd.DataFrame(data,index=['s1','s2','s3','s4'])
df

    maths  physics  chemistry
s1     75       25         56
s2     58       85         45
s3     12       25         10
s4     10      100          2

In [41]:
df=pd.DataFrame({"maths":pd.Series([23,45,67])})
df

   maths
0     23
1     45
2     67

In [42]:
data={"maths":[75,58,12,10],"physics":[25,85,25,100],"chemistry":[56,45,10,2]}
df=pd.DataFrame(data,index=['s1','s2','s3','s4'])
df

    maths  physics  chemistry
s1     75       25         56
s2     58       85         45
s3     12       25         10
s4     10      100          2

In [43]:
df.index

Index(['s1', 's2', 's3', 's4'], dtype='object')

In [44]:
df.columns

Index(['maths', 'physics', 'chemistry'], dtype='object')

In [45]:
df.values

array([[ 75,  25,  56],
       [ 58,  85,  45],
       [ 12,  25,  10],
       [ 10, 100,   2]], dtype=int64)

In [46]:
df

    maths  physics  chemistry
s1     75       25         56
s2     58       85         45
s3     12       25         10
s4     10      100          2

In [48]:
# column data
#direct indexing
df["maths"]  #for single column

s1    75
s2    58
s3    12
s4    10
Name: maths, dtype: int64

In [50]:
df[["maths","physics"]]   #for multiple columns

    maths  physics
s1     75       25
s2     58       85
s3     12       25
s4     10      100

In [51]:
df["chemistry"]

s1    56
s2    45
s3    10
s4     2
Name: chemistry, dtype: int64

In [52]:
df["chemistry"][0]

56

- loc(location)---df.loc[rows,col]-----should specify only the label names
- iloc(index location)---df.iloc[rows,col]------should specify the positon numbers

In [53]:
df

    maths  physics  chemistry
s1     75       25         56
s2     58       85         45
s3     12       25         10
s4     10      100          2

In [54]:
df.loc['s1']  #single row

maths        75
physics      25
chemistry    56
Name: s1, dtype: int64

In [55]:
df.loc["s1"][0]

75

In [56]:
df.loc['s1']['maths']

75

In [57]:
df.loc[["s2",'s3']]  #multiple rows

    maths  physics  chemistry
s2     58       85         45
s3     12       25         10

In [58]:
## rows---s3,s4
## col---physics,chemistry

In [59]:
#df.loc[rows,col]
df.loc[['s3','s4'],['physics','chemistry']]

    physics  chemistry
s3       25         10
s4      100          2

In [60]:
df.loc[['s3','s4']][['physics','chemistry']]

    physics  chemistry
s3       25         10
s4      100          2

In [61]:
df.iloc[[0,1]]   #for the first two rows

    maths  physics  chemistry
s1     75       25         56
s2     58       85         45

In [62]:
df.iloc[[0,1],[1,2]]  #for the first two rows and last two col

    physics  chemistry
s1       25         56
s2       85         45

In [63]:
df

    maths  physics  chemistry
s1     75       25         56
s2     58       85         45
s3     12       25         10
s4     10      100          2

In [64]:
df["m1"]=[45,78,12,10]

In [65]:
df

    maths  physics  chemistry  m1
s1     75       25         56  45
s2     58       85         45  78
s3     12       25         10  12
s4     10      100          2  10

In [66]:
df["m2"]=[78,56,14,20]

In [67]:
df

    maths  physics  chemistry  m1  m2
s1     75       25         56  45  78
s2     58       85         45  78  56
s3     12       25         10  12  14
s4     10      100          2  10  20

In [70]:
#for last 3 columns and last two rows using iloc
#df.iloc[rows,columns]
df.iloc[2:4,-3:]

    chemistry  m1  m2
s3         10  12  14
s4          2  10  20

In [71]:
df.iloc[2:,2:]

    chemistry  m1  m2
s3         10  12  14
s4          2  10  20

In [72]:
df

    maths  physics  chemistry  m1  m2
s1     75       25         56  45  78
s2     58       85         45  78  56
s3     12       25         10  12  14
s4     10      100          2  10  20

In [73]:
df.iloc[2:,-2:]

    m1  m2
s3  12  14
s4  10  20

In [74]:
df

    maths  physics  chemistry  m1  m2
s1     75       25         56  45  78
s2     58       85         45  78  56
s3     12       25         10  12  14
s4     10      100          2  10  20

In [75]:
df.index=df["maths"]

In [76]:
df

       maths  physics  chemistry  m1  m2
maths
75        75       25         56  45  78
58        58       85         45  78  56
12        12       25         10  12  14
10        10      100          2  10  20

In [77]:
df.max()   #max values for every column by default axis=0

maths         75
physics      100
chemistry     56
m1            78
m2            78
dtype: int64

In [79]:
df.index=['s1','s2','s3','s4']

In [80]:
df

    maths  physics  chemistry  m1  m2
s1     75       25         56  45  78
s2     58       85         45  78  56
s3     12       25         10  12  14
s4     10      100          2  10  20

In [81]:
df.max(1)  #max values for every row

s1     78
s2     85
s3     25
s4    100
dtype: int64

In [82]:
df.min()  #min value for every col

maths        10
physics      25
chemistry     2
m1           10
m2           14
dtype: int64

In [83]:
df.min(1)   #min value for row

s1    25
s2    45
s3    10
s4     2
dtype: int64

In [84]:
df.sum()

maths        155
physics      235
chemistry    113
m1           145
m2           168
dtype: int64

In [85]:
df.sum(1)

s1    279
s2    322
s3     73
s4    142
dtype: int64

In [86]:
df.mean() # colwise average

maths        38.75
physics      58.75
chemistry    28.25
m1           36.25
m2           42.00
dtype: float64

In [87]:
df.mean(1)  #row wise average

s1    55.8
s2    64.4
s3    14.6
s4    28.4
dtype: float64

Combined Average Income of all states from 2005 to 2013
State with highest average income in the last three years
State with lowest average income from 2007 to 2010(inclusive)
Print the list of all states in the same line with average income less than California
Print the names of states based on descending order of income in the year 2009

In [90]:
df=pd.read_csv("income.csv")
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [93]:
df.head(3)  #for the first three rows

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602

In [94]:
df.tail(3)   #for the last three rows

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528